#include "UI.h"
void UI::initial()
{
	cout << "欢迎使用书库管理系统...\n\n"
		 << "首次使用需要配置管理员信息, 请依次输入管理员的ID和密码, 以空格隔开.\n";
}
void UI::welcome()
{
	cout <<"欢迎使用书库管理系统...\n"
		 <<"请选择要登录的界面(0为顾客,1为管理员)\n";
}
void UI::logIn()
{
	cout << "请依次输入账户名和密码,以空格隔开\n"
		 << "登录中...";
}
void UI::guest(user guest)
{
	cout<< "**************书库管理系统**************\n\n"
		<< "请选择操作:\n"
		<< "<0>查询\n"//按分类,按书名,按作者,按书号
		<< "<1>预定\n"//通知信息.txt
		<< "<2>帮助\n"
		<< "<3>登录\n\n"
		<< "***************************************\n";
}
void UI::manager(user manager)
{
	cout<< "**************书库管理系统**************\n\n"
		<< "请选择操作:\n"
		<< "<0>增加\n" //根据书名判断书库中是否已有,如有询问是否继续添加.但书号要求不同
		<< "<1>删除\n"//判断书库中是否有要删除的书籍
		<< "<2>修改\n"//同上
		<< "<3>统计\n"//每周, 每月销售记录.需要读取系统时间, 并写入有一个文件, 考虑新建一个类log来处理销售记录.
		<< "<4>退出\n\n"
		<< "***************************************\n";
}
void inquire()
{
	string choice;
	cout << "请选择查找方式:\n\n"
		<< "<0>分类查找\n"
		<< "<1>查找书名\n"
		<< "<2>查找作者\n\n";
}