#include "UI.h"
void UI::initial()
{
	cout << "欢迎使用书库管理系统...\n\n"
		 << "首次使用需要配置管理员信息, 请依次输入管理员的ID和密码, 以空格隔开.\n";
}
void UI::welcome()
{
	cout <<"欢迎使用书库管理系统...\n"
		 <<"请选择要登录的界面(0为顾客,1为管理员)\n";
}
void UI::logIn()
{
	cout << "请依次输入账户名和密码,以空格隔开\n"
		 << "登录中...";
}
void UI::guest(user guest)
{
	cout<< "**************书库管理系统**************\n\n"
		<< "请选择操作:\n"
		<< "<0>查询\n"
		<< "<1>购买\n"
		<< "<2>退出\n\n"
		<< "***************************************\n";
}
void UI::manager(user manager)
{
	cout<< "**************书库管理系统**************\n\n"
		<< "请选择操作:\n"
		<< "<0>增加\n"
		<< "<1>删除\n"
		<< "<2>修改\n"
		<< "<3>统计\n"
		<< "<4>退出\n\n"
		<< "***************************************\n";
}
